# IdeaStatiCa.ConnectionApi.Model.ConCutOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**Member** | **ConCutMemberTarget** |  |
**CutBy** | **ConCutByTarget** |  |
**CuttingMethod** | **ConCuttingMethod** |  | [optional]
**ExtendMember** | **bool** |  | [optional]
**CuttingPlane** | **ConCuttingPlane** |  | [optional]
**Direction** | **ConCuttingDirection** |  | [optional]
**Offset** | **double** |  | [optional]
**WebsWeld** | **ConWeldData** |  | [optional]
**FlangesWeld** | **ConWeldData** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)